[문1] 아래 조건을 만족하는 Series를 생성하세요.
1) 데이터 : 1~50 범위에서 7의 배수 정수
2) 인덱스 : 'a~z' 범위에서 데이터 갯수 만큼의 알파벳
3) 타  입 : 부호가 없는 1바이트 정수
4) 이  름 : sevens
5) 속  성 : index, values, dtype, ndim, shape, size

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = []
for d in range(7,50,7):
  data.append(d)

In [4]:
dataSr = pd.Series(data, dtype = 'uint64', name = 'sevens')
dataSr

0     7
1    14
2    21
3    28
4    35
5    42
6    49
Name: sevens, dtype: uint64

In [5]:
alList = ['a','b','c','d','e','f','g']

In [6]:
dataSr.index = alList

In [7]:
dataSr.index
dataSr.values
dataSr.dtype
dataSr.ndim
dataSr.shape
dataSr.size

7

[문2] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : knu_data.csv
2) 인덱스 : 컬럼 중 하나를 인덱스로 설정
3) 속성 정보 출력
4) 데이터 확인 정보 출력
5) 타입과 실제 데이터 타입 일치

In [8]:
knuDF = pd.read_csv('../DATA/knu_data.csv')

In [9]:
knuDF.set_index('mem_id')

          team            time
mem_id
knu_21   경영지원팀  20231102200000
knu_03   대외협력팀  20231117200000
knu_01   대외협력팀  20231109200000
knu_09   경영지원팀  20221122200000
knu_01   경영지원팀  20221111200000

In [10]:
knuDF.columns, knuDF.index, knuDF.size, knuDF.ndim, knuDF.dtypes, knuDF.shape

(Index(['mem_id', 'team', 'time'], dtype='object'),
 RangeIndex(start=0, stop=5, step=1),
 15,
 2,
 mem_id    object
 team      object
 time       int64
 dtype: object,
 (5, 3))

In [11]:
knuDF.info()
# 타임이 인트형임 -> datetime타입으로 캐스팅
knuDF.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mem_id  5 non-null      object
 1   team    5 non-null      object
 2   time    5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

        mem_id    team          time
count        5       5  5.000000e+00
unique       4       2           NaN
top     knu_01   경영지원팀           NaN
freq         2       3           NaN
mean       NaN     NaN  2.022711e+13
std        NaN     NaN  5.473304e+09
min        NaN     NaN  2.022111e+13
25%        NaN     NaN  2.022112e+13
50%        NaN     NaN  2.023110e+13
75%        NaN     NaN  2.023111e+13
max        NaN     NaN  2.023112e+13

In [12]:
knuDF['time'].astype('datetime')

TypeError: data type 'datetime' not understood

[문3] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stats_100701.xlsx
2) 년도별 인구가 가장 많은 지역과 가장 적은 지역
3) 6대 광역시에서 년도별 인구가 가장 많은 지역과 가장 적은 지역
4) 8도 중 7도에서 년도별 인구가 가장 많은 지역과 가장 적은 지역

In [19]:
statsDF = pd.read_excel('../DATA/stats_100701.xlsx', index_col=[0], skiprows=[0,2])
statsDF

      2015   2016   2017   2018
서울    9941   9843   9766   9705
부산    3452   3447   3424   3400
대구    2469   2461   2458   2450
인천    2883   2907   2924   2939
광주    1506   1502   1495   1493
대전    1542   1536   1528   1518
울산    1164   1166   1159   1154
세종     187    234    266    304
경기   12423  12600  12786  13031
강원    1517   1521   1521   1521
충북    1589   1601   1609   1619
충남    2103   2126   2153   2180
전북    1835   1835   1829   1820
전남    1797   1798   1795   1790
경북    2678   2683   2675   2674
경남    3330   3338   3339   3356
제주     599    618    635    653
수도권  25247  25350  25476  25675

In [20]:
statsDF.nlargest(n=1, columns=[2015,2016,2017,2018])

      2015   2016   2017   2018
수도권  25247  25350  25476  25675

In [21]:
statsDF.nsmallest(n=1, columns=[2015,2016,2017,2018])

    2015  2016  2017  2018
세종   187   234   266   304

In [23]:
city6DF = statsDF[statsDF.index.isin(['서울','대구','부산','대전','광주','인천'])]
city7DF = statsDF[statsDF.index.isin(['경기', '충북', '충남', '전북', '전남', '경북', '경남'])]

In [24]:
city6DF.nlargest(n=1, columns=[2015,2016,2017,2018])

    2015  2016  2017  2018
서울  9941  9843  9766  9705

In [25]:
city6DF.nsmallest(n=1, columns=[2015,2016,2017,2018])

    2015  2016  2017  2018
광주  1506  1502  1495  1493

In [26]:
city7DF.nlargest(n=1, columns=[2015,2016,2017,2018])

     2015   2016   2017   2018
경기  12423  12600  12786  13031

In [28]:
city7DF.nsmallest(n=1, columns=[2015,2016,2017,2018])

    2015  2016  2017  2018
충북  1589  1601  1609  1619

[문4] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stock price.xlsx
2) 데이터 로딩 시 인덱스로 사용할 수 있는 컬럼 설정
3) 결측치 처리 =>
   (가) 1개라도 NaN이면 모두 제거 / price가 NaN이면 제거 / value가 10000이하면 제거
   (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체
4) value가 1000이하 이거나 price가 90000이상인 데이터

In [ ]:
stockDF = pd.read_excel('../DATA/stock price.xlsx', index_col=[0])
stockDF

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
138040    메리츠금융지주     827.500000       NaN
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
181710  NHN엔터테인먼트            NaN       NaN
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0
207940   삼성바이오로직스            NaN   91900.0

In [ ]:
# (가)
stockDF2 = stockDF.dropna()
stockDF2 = stockDF.dropna(subset='price')
stockDF2 = stockDF[stockDF['value']<=1000].dropna()

In [ ]:
# (나)
stockDF.isna().sum()  # value에 두개 price에 두개
# 평균으로 대체
stockDF3 = stockDF['value'].fillna(stockDF['value'].mean())
stockDF3 = stockDF['price'].fillna(stockDF['price'].mean())

# 이전값으로 대체
stockDF4 = stockDF['value'].fillna(method='ffill')
stockDF4 = stockDF['price'].fillna(method='ffill')

# 이후값으로 대체
stockDF5 = stockDF['value'].fillna(method='bfill')
stockDF5 = stockDF['price'].fillna(method='bfill')

In [ ]:
stockDF3.isna().sum()
stockDF4.isna().sum()
stockDF5.isna().sum()
# 결측치 없는거 확인 가능

0

In [ ]:
stockDF[(stockDF['value']<=1000)|(stockDF['price']>=90000)]

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
138040    메리츠금융지주     827.500000       NaN
130960     CJ E&M   58540.666667   98900.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
207940   삼성바이오로직스            NaN   91900.0